tf plan output if that helps

```
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.honeycomb-publisher-test.aws_cloudwatch_log_subscription_filter.subscription_filters["/path/to/my/log/group/2"] will be created
  + resource "aws_cloudwatch_log_subscription_filter" "subscription_filters" {
      + destination_arn = (known after apply)
      + id              = (known after apply)
      + log_group_name  = "/path/to/my/log/group/2"
      + name            = "honeycomb-publisher-/path/to/my/log/group/2"
      + role_arn        = (known after apply)
    }

  # module.honeycomb-publisher-test.aws_cloudwatch_log_subscription_filter.subscription_filters["/path/to/my/log/group1"] will be created
  + resource "aws_cloudwatch_log_subscription_filter" "subscription_filters" {
      + destination_arn = (known after apply)
      + id              = (known after apply)
      + log_group_name  = "/path/to/my/log/group1"
      + name            = "honeycomb-publisher-/path/to/my/log/group1"
      + role_arn        = (known after apply)
    }

  # module.honeycomb-publisher-test.aws_lambda_function.honeycomb_publisher will be created
  + resource "aws_lambda_function" "honeycomb_publisher" {
      + arn                            = (known after apply)
      + function_name                  = "honeycomb-publisher-your-application-project-name-production-logs"
      + handler                        = "publisher"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "go1.x"
      + s3_bucket                      = "honeycomb-integrations-us-east-1"
      + s3_key                         = "agentless-integrations-for-aws/1.6.0/ingest-handlers.zip"
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "API_HOST"            = "https://api.honeycomb.io"
              + "DATASET"             = "your-dataset-name-on-honeycomb"
              + "HONEYCOMB_WRITE_KEY" = "CiphertextBlob-of-your-KMS-encrypted-honeycomb-write-key"
              + "KMS_KEY_ID"          = "kms-key-id-used-to-encrypt-the-write-key"
            }
        }

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # module.honeycomb-publisher-test.aws_lambda_permission.allow_cloudwatch will be created
  + resource "aws_lambda_permission" "allow_cloudwatch" {
      + action        = "lambda:InvokeFunction"
      + function_name = (known after apply)
      + id            = (known after apply)
      + principal     = "logs.amazonaws.com"
      + statement_id  = "AllowExecutionFromCloudWatch"
    }

  # module.honeycomb-publisher-test.module.permissions.aws_iam_role.honeycomb_logs_role will be created
  + resource "aws_iam_role" "honeycomb_logs_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "honeycomb-publisher-logs-role"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # module.honeycomb-publisher-test.module.permissions.aws_iam_role_policy.honeycomb_lambda_kms_policy will be created
  + resource "aws_iam_role_policy" "honeycomb_lambda_kms_policy" {
      + id     = (known after apply)
      + name   = "honeycomb-publisher-lambda-kms-policy"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "kms:Decrypt"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:kms:*:*:key/kms-key-id-used-to-encrypt-the-write-key"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

  # module.honeycomb-publisher-test.module.permissions.aws_iam_role_policy.honeycomb_lambda_log_policy will be created
  + resource "aws_iam_role_policy" "honeycomb_lambda_log_policy" {
      + id     = (known after apply)
      + name   = "honeycomb-publisher-lambda-logs-policy"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:*:*:*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

Plan: 7 to add, 0 to change, 0 to destroy.
```